# DataSets

In [4]:
import seaborn as sb
import pandas as pd

In [5]:
df=pd.read_csv(r'D:\Num_Pan_BTM\DA\practice\datasets\titanic_data.csv')

In [6]:
df

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,survived
0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,1
1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,1
2,1,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,0
3,1,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,0
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,0
...,...,...,...,...,...,...,...,...,...,...,...
1304,3,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,NaN,C,0
1305,3,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,0
1306,3,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,7.2250,NaN,C,0
1307,3,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,7.2250,NaN,C,0
1308,3,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750,NaN,S,0

In [7]:
df.to_csv('titanic_data.csv')

In [8]:
df.head()

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,survived
0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,1
1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,1
2,1,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,0
3,1,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,0
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,0

**sibsp----> count of siblings, spouse**

**parc----> count of parents, child**

**fare---->amount**

**embarked---->port**

# Data Cleaning

**Check for duplicates and handle them**

**check for missing data and handle them**

**check for invalid dtypes and handle them**

In [9]:
df.duplicated().any() # no duplicates records

np.False_

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   pclass    1309 non-null   int64
 1   name      1309 non-null   object
 2   sex       1309 non-null   object
 3   age       1046 non-null   float64
 4   sibsp     1309 non-null   int64
 5   parch     1309 non-null   int64
 6   ticket    1309 non-null   object
 7   fare      1308 non-null   float64
 8   cabin     295 non-null    object
 9   embarked  1307 non-null   object
 10  survived  1309 non-null   int64
dtypes: float64(2), int64(4), object(5)
memory usage: 112.6+ KB

In [11]:
age_mean=df['age'].mean()
fare_mean=df['fare'].mean()

In [12]:
emb_mode=df['embarked'].mode()[0]

In [13]:
df['age']=df['age'].fillna(age_mean)
df['fare']=df['fare'].fillna(fare_mean)
df['embarked']=df['embarked'].fillna(emb_mode)

In [14]:
df=df.dropna(axis=1)

In [15]:
df.info() # no missing data and no invalid data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   pclass    1309 non-null   int64
 1   name      1309 non-null   object
 2   sex       1309 non-null   object
 3   age       1309 non-null   float64
 4   sibsp     1309 non-null   int64
 5   parch     1309 non-null   int64
 6   ticket    1309 non-null   object
 7   fare      1309 non-null   float64
 8   embarked  1309 non-null   object
 9   survived  1309 non-null   int64
dtypes: float64(2), int64(4), object(4)
memory usage: 102.4+ KB

# Data Transformation/ Data Manipulation/ Feature Engineering

**Create or overview the column using existing column**

In [16]:
df.head(3)

,pclass,name,sex,age,sibsp,parch,ticket,fare,embarked,survived
0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,S,1
1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,S,1
2,1,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,S,0

In [17]:
df['pclass'].unique()

array([1, 2, 3])

In [18]:
df['name'].str.split(',',expand=True)

              0                                        1
0         Allen                   Miss. Elisabeth Walton
1       Allison                    Master. Hudson Trevor
2       Allison                      Miss. Helen Loraine
3       Allison              Mr. Hudson Joshua Creighton
4       Allison   Mrs. Hudson J C (Bessie Waldo Daniels)
...         ...                                      ...
1304     Zabour                             Miss. Hileni
1305     Zabour                            Miss. Thamine
1306   Zakarian                          Mr. Mapriededer
1307   Zakarian                                Mr. Ortin
1308  Zimmerman                                  Mr. Leo

[1309 rows x 2 columns]

In [19]:
df[['lname','temp']]=df['name'].str.split(',',expand=True)
df

,pclass,name,sex,age,sibsp,parch,ticket,fare,embarked,survived,lname,temp
0,1,"Allen, Miss. Elisabeth Walton",female,29.000000,0,0,24160,211.3375,S,1,Allen,Miss. Elisabeth Walton
1,1,"Allison, Master. Hudson Trevor",male,0.916700,1,2,113781,151.5500,S,1,Allison,Master. Hudson Trevor
2,1,"Allison, Miss. Helen Loraine",female,2.000000,1,2,113781,151.5500,S,0,Allison,Miss. Helen Loraine
3,1,"Allison, Mr. Hudson Joshua Creighton",male,30.000000,1,2,113781,151.5500,S,0,Allison,Mr. Hudson Joshua Creighton
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.000000,1,2,113781,151.5500,S,0,Allison,Mrs. Hudson J C (Bessie Waldo Daniels)
...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,"Zabour, Miss. Hileni",female,14.500000,1,0,2665,14.4542,C,0,Zabour,Miss. Hileni
1305,3,"Zabour, Miss. Thamine",female,29.881135,1,0,2665,14.4542,C,0,Zabour,Miss. Thamine
1306,3,"Zakarian, Mr. Mapriededer",male,26.500000,0,0,2656,7.2250,C,0,Zakarian,Mr. Mapriededer
1307,3,"Zakarian, Mr. Ortin",male,27.000000,0,0,2670,7.2250,C,0,Zakarian,Mr. Ortin
1308,3,"Zimmerman, Mr. Leo",male,29.000000,0,0,315082,7.8750,S,0,Zimmerman,Mr. Leo

In [20]:
df[['courtsey_title','fname']]=df['temp'].str.split('.',expand=True,n=1)
df.head(3)

,pclass,name,sex,age,sibsp,parch,ticket,fare,embarked,survived,lname,temp,courtsey_title,fname
0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,S,1,Allen,Miss. Elisabeth Walton,Miss,Elisabeth Walton
1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,S,1,Allison,Master. Hudson Trevor,Master,Hudson Trevor
2,1,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,S,0,Allison,Miss. Helen Loraine,Miss,Helen Loraine

In [21]:
df['fname']=df['fname'].str.strip()
df['lname']=df['lname'].str.strip()
df['courtsey_title']=df['courtsey_title'].str.strip()
df.head(3)

,pclass,name,sex,age,sibsp,parch,ticket,fare,embarked,survived,lname,temp,courtsey_title,fname
0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,S,1,Allen,Miss. Elisabeth Walton,Miss,Elisabeth Walton
1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,S,1,Allison,Master. Hudson Trevor,Master,Hudson Trevor
2,1,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,S,0,Allison,Miss. Helen Loraine,Miss,Helen Loraine

In [22]:
df=df.drop(columns=['name','temp'])
df

,pclass,sex,age,sibsp,parch,ticket,fare,embarked,survived,lname,courtsey_title,fname
0,1,female,29.000000,0,0,24160,211.3375,S,1,Allen,Miss,Elisabeth Walton
1,1,male,0.916700,1,2,113781,151.5500,S,1,Allison,Master,Hudson Trevor
2,1,female,2.000000,1,2,113781,151.5500,S,0,Allison,Miss,Helen Loraine
3,1,male,30.000000,1,2,113781,151.5500,S,0,Allison,Mr,Hudson Joshua Creighton
4,1,female,25.000000,1,2,113781,151.5500,S,0,Allison,Mrs,Hudson J C (Bessie Waldo Daniels)
...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,female,14.500000,1,0,2665,14.4542,C,0,Zabour,Miss,Hileni
1305,3,female,29.881135,1,0,2665,14.4542,C,0,Zabour,Miss,Thamine
1306,3,male,26.500000,0,0,2656,7.2250,C,0,Zakarian,Mr,Mapriededer
1307,3,male,27.000000,0,0,2670,7.2250,C,0,Zakarian,Mr,Ortin
1308,3,male,29.000000,0,0,315082,7.8750,S,0,Zimmerman,Mr,Leo

In [23]:
# df['name']=df['courtsey_title']+'.'+df['fname']

In [24]:
df=df.rename(columns={'sex':'gender'})

In [25]:
df['gender']=df['gender'].str.capitalize()
df

,pclass,gender,age,sibsp,parch,ticket,fare,embarked,survived,lname,courtsey_title,fname
0,1,Female,29.000000,0,0,24160,211.3375,S,1,Allen,Miss,Elisabeth Walton
1,1,Male,0.916700,1,2,113781,151.5500,S,1,Allison,Master,Hudson Trevor
2,1,Female,2.000000,1,2,113781,151.5500,S,0,Allison,Miss,Helen Loraine
3,1,Male,30.000000,1,2,113781,151.5500,S,0,Allison,Mr,Hudson Joshua Creighton
4,1,Female,25.000000,1,2,113781,151.5500,S,0,Allison,Mrs,Hudson J C (Bessie Waldo Daniels)
...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,Female,14.500000,1,0,2665,14.4542,C,0,Zabour,Miss,Hileni
1305,3,Female,29.881135,1,0,2665,14.4542,C,0,Zabour,Miss,Thamine
1306,3,Male,26.500000,0,0,2656,7.2250,C,0,Zakarian,Mr,Mapriededer
1307,3,Male,27.000000,0,0,2670,7.2250,C,0,Zakarian,Mr,Ortin
1308,3,Male,29.000000,0,0,315082,7.8750,S,0,Zimmerman,Mr,Leo

In [26]:
df['gender'].unique()

array(['Female', 'Male'], dtype=object)

In [27]:
df['age']=df['age'].round(1)

In [28]:
df['fam_cnt']=df['sibsp']+df['parch']

In [29]:
df.head(3)

,pclass,gender,age,sibsp,parch,ticket,fare,embarked,survived,lname,courtsey_title,fname,fam_cnt
0,1,Female,29.0,0,0,24160,211.3375,S,1,Allen,Miss,Elisabeth Walton,0
1,1,Male,0.9,1,2,113781,151.5500,S,1,Allison,Master,Hudson Trevor,3
2,1,Female,2.0,1,2,113781,151.5500,S,0,Allison,Miss,Helen Loraine,3

In [30]:
df=df.sort_values(by=['ticket','age'],ascending=[True,False])

In [31]:
df.head(3)

,pclass,gender,age,sibsp,parch,ticket,fare,embarked,survived,lname,courtsey_title,fname,fam_cnt
245,1,Female,33.0,0,0,110152,86.5,S,1,Rothes,the Countess,of (Lucy Noel Martha Dyer-Edwards),0
67,1,Female,30.0,0,0,110152,86.5,S,1,Cherry,Miss,Gladys,0
195,1,Female,16.0,0,0,110152,86.5,S,1,Maioni,Miss,Roberta,0

In [32]:
df=df.reset_index(drop=True)
df

,pclass,gender,age,sibsp,parch,ticket,fare,embarked,survived,lname,courtsey_title,fname,fam_cnt
0,1,Female,33.0,0,0,110152,86.500,S,1,Rothes,the Countess,of (Lucy Noel Martha Dyer-Edwards),0
1,1,Female,30.0,0,0,110152,86.500,S,1,Cherry,Miss,Gladys,0
2,1,Female,16.0,0,0,110152,86.500,S,1,Maioni,Miss,Roberta,0
3,1,Male,52.0,1,1,110413,79.650,S,0,Taussig,Mr,Emil,2
4,1,Female,39.0,1,1,110413,79.650,S,1,Taussig,Mrs,Emil (Tillie Mandelbaum),2
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,1,Female,47.0,1,0,W.E.P. 5734,61.175,S,1,Chaffee,Mrs,Herbert Fuller (Carrie Constance Toogood),1
1305,1,Male,46.0,1,0,W.E.P. 5734,61.175,S,0,Chaffee,Mr,Herbert Fuller,1
1306,2,Male,30.0,0,0,W/C 14208,10.500,S,0,Harris,Mr,Walter,0
1307,1,Male,70.0,1,1,WE/P 5735,71.000,S,0,Crosby,Capt,Edward Gifford,2
1308,1,Female,36.0,0,2,WE/P 5735,71.000,S,1,Crosby,Miss,Harriet R,2

In [33]:
df['age'].unique()

array([33. , 30. , 16. , 52. , 39. , 18. , 47. , 29.9, 42. , 28. , 64. ,
       60. , 61. , 44. , 26. , 35. , 45. , 19. , 49. , 40. , 55. , 22. ,
       45.5, 50. , 41. , 51. , 17. , 29. , 32.5, 27. , 65. , 62. , 38. ,
       36. , 14. , 11. , 53. , 25. ,  2. ,  0.9, 58. , 56. , 34. , 21. ,
       37. , 48. , 24. , 23. , 59. , 54. , 43. , 32. , 46. , 63. , 31. ,
        6. , 76. , 57. , 36.5,  3. , 12. ,  4. ,  1. , 20. , 15. , 18.5,
        0.8, 13. ,  0.7,  0.4,  8. ,  9. ,  7. , 26.5, 14.5,  5. , 34.5,
       23.5, 28.5, 22.5, 80. , 24.5, 10. , 74. ,  0.3, 30.5, 40.5, 60.5,
       70.5, 55.5, 20.5, 11.5,  0.2, 66. , 70. , 67. , 71. , 38.5])

In [34]:
df['fare']=df['fare'].round(1)
df

,pclass,gender,age,sibsp,parch,ticket,fare,embarked,survived,lname,courtsey_title,fname,fam_cnt
0,1,Female,33.0,0,0,110152,86.5,S,1,Rothes,the Countess,of (Lucy Noel Martha Dyer-Edwards),0
1,1,Female,30.0,0,0,110152,86.5,S,1,Cherry,Miss,Gladys,0
2,1,Female,16.0,0,0,110152,86.5,S,1,Maioni,Miss,Roberta,0
3,1,Male,52.0,1,1,110413,79.6,S,0,Taussig,Mr,Emil,2
4,1,Female,39.0,1,1,110413,79.6,S,1,Taussig,Mrs,Emil (Tillie Mandelbaum),2
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,1,Female,47.0,1,0,W.E.P. 5734,61.2,S,1,Chaffee,Mrs,Herbert Fuller (Carrie Constance Toogood),1
1305,1,Male,46.0,1,0,W.E.P. 5734,61.2,S,0,Chaffee,Mr,Herbert Fuller,1
1306,2,Male,30.0,0,0,W/C 14208,10.5,S,0,Harris,Mr,Walter,0
1307,1,Male,70.0,1,1,WE/P 5735,71.0,S,0,Crosby,Capt,Edward Gifford,2
1308,1,Female,36.0,0,2,WE/P 5735,71.0,S,1,Crosby,Miss,Harriet R,2

In [35]:
df.head()

,pclass,gender,age,sibsp,parch,ticket,fare,embarked,survived,lname,courtsey_title,fname,fam_cnt
0,1,Female,33.0,0,0,110152,86.5,S,1,Rothes,the Countess,of (Lucy Noel Martha Dyer-Edwards),0
1,1,Female,30.0,0,0,110152,86.5,S,1,Cherry,Miss,Gladys,0
2,1,Female,16.0,0,0,110152,86.5,S,1,Maioni,Miss,Roberta,0
3,1,Male,52.0,1,1,110413,79.6,S,0,Taussig,Mr,Emil,2
4,1,Female,39.0,1,1,110413,79.6,S,1,Taussig,Mrs,Emil (Tillie Mandelbaum),2

In [36]:
df['embarked'].unique()

array(['S', 'C', 'Q'], dtype=object)

In [37]:
d={'S':'southampton','C':'cherbourg','Q':'queenstown'}

In [38]:
df['embarked']=df['embarked'].replace(d)

In [39]:
df

,pclass,gender,age,sibsp,parch,ticket,fare,embarked,survived,lname,courtsey_title,fname,fam_cnt
0,1,Female,33.0,0,0,110152,86.5,southampton,1,Rothes,the Countess,of (Lucy Noel Martha Dyer-Edwards),0
1,1,Female,30.0,0,0,110152,86.5,southampton,1,Cherry,Miss,Gladys,0
2,1,Female,16.0,0,0,110152,86.5,southampton,1,Maioni,Miss,Roberta,0
3,1,Male,52.0,1,1,110413,79.6,southampton,0,Taussig,Mr,Emil,2
4,1,Female,39.0,1,1,110413,79.6,southampton,1,Taussig,Mrs,Emil (Tillie Mandelbaum),2
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,1,Female,47.0,1,0,W.E.P. 5734,61.2,southampton,1,Chaffee,Mrs,Herbert Fuller (Carrie Constance Toogood),1
1305,1,Male,46.0,1,0,W.E.P. 5734,61.2,southampton,0,Chaffee,Mr,Herbert Fuller,1
1306,2,Male,30.0,0,0,W/C 14208,10.5,southampton,0,Harris,Mr,Walter,0
1307,1,Male,70.0,1,1,WE/P 5735,71.0,southampton,0,Crosby,Capt,Edward Gifford,2
1308,1,Female,36.0,0,2,WE/P 5735,71.0,southampton,1,Crosby,Miss,Harriet R,2

In [40]:
tick_psgs=df['ticket'].value_counts().reset_index(name='no_of_psgs')
# grouped_col---> index and count(agg)---->column(values)

In [41]:
tick_psgs

               ticket  no_of_psgs
0            CA. 2343          11
1             CA 2144           8
2                1601           8
3        S.O.C. 14879           7
4              347082           7
..                ...         ...
924  SOTON/O2 3101272           1
925  STON/O2. 3101283           1
926  STON/O2. 3101282           1
927  STON/O2. 3101271           1
928            112050           1

[929 rows x 2 columns]

In [42]:
df=pd.merge(df,tick_psgs,on='ticket',how='inner')
df

,pclass,gender,age,sibsp,parch,ticket,fare,embarked,survived,lname,courtsey_title,fname,fam_cnt,no_of_psgs
0,1,Female,33.0,0,0,110152,86.5,southampton,1,Rothes,the Countess,of (Lucy Noel Martha Dyer-Edwards),0,3
1,1,Female,30.0,0,0,110152,86.5,southampton,1,Cherry,Miss,Gladys,0,3
2,1,Female,16.0,0,0,110152,86.5,southampton,1,Maioni,Miss,Roberta,0,3
3,1,Male,52.0,1,1,110413,79.6,southampton,0,Taussig,Mr,Emil,2,3
4,1,Female,39.0,1,1,110413,79.6,southampton,1,Taussig,Mrs,Emil (Tillie Mandelbaum),2,3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,1,Female,47.0,1,0,W.E.P. 5734,61.2,southampton,1,Chaffee,Mrs,Herbert Fuller (Carrie Constance Toogood),1,2
1305,1,Male,46.0,1,0,W.E.P. 5734,61.2,southampton,0,Chaffee,Mr,Herbert Fuller,1,2
1306,2,Male,30.0,0,0,W/C 14208,10.5,southampton,0,Harris,Mr,Walter,0,1
1307,1,Male,70.0,1,1,WE/P 5735,71.0,southampton,0,Crosby,Capt,Edward Gifford,2,2
1308,1,Female,36.0,0,2,WE/P 5735,71.0,southampton,1,Crosby,Miss,Harriet R,2,2

In [43]:
df

,pclass,gender,age,sibsp,parch,ticket,fare,embarked,survived,lname,courtsey_title,fname,fam_cnt,no_of_psgs
0,1,Female,33.0,0,0,110152,86.5,southampton,1,Rothes,the Countess,of (Lucy Noel Martha Dyer-Edwards),0,3
1,1,Female,30.0,0,0,110152,86.5,southampton,1,Cherry,Miss,Gladys,0,3
2,1,Female,16.0,0,0,110152,86.5,southampton,1,Maioni,Miss,Roberta,0,3
3,1,Male,52.0,1,1,110413,79.6,southampton,0,Taussig,Mr,Emil,2,3
4,1,Female,39.0,1,1,110413,79.6,southampton,1,Taussig,Mrs,Emil (Tillie Mandelbaum),2,3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,1,Female,47.0,1,0,W.E.P. 5734,61.2,southampton,1,Chaffee,Mrs,Herbert Fuller (Carrie Constance Toogood),1,2
1305,1,Male,46.0,1,0,W.E.P. 5734,61.2,southampton,0,Chaffee,Mr,Herbert Fuller,1,2
1306,2,Male,30.0,0,0,W/C 14208,10.5,southampton,0,Harris,Mr,Walter,0,1
1307,1,Male,70.0,1,1,WE/P 5735,71.0,southampton,0,Crosby,Capt,Edward Gifford,2,2
1308,1,Female,36.0,0,2,WE/P 5735,71.0,southampton,1,Crosby,Miss,Harriet R,2,2

In [44]:
df['fare']=(df['fare']/df['no_of_psgs']).round(1)
df

,pclass,gender,age,sibsp,parch,ticket,fare,embarked,survived,lname,courtsey_title,fname,fam_cnt,no_of_psgs
0,1,Female,33.0,0,0,110152,28.8,southampton,1,Rothes,the Countess,of (Lucy Noel Martha Dyer-Edwards),0,3
1,1,Female,30.0,0,0,110152,28.8,southampton,1,Cherry,Miss,Gladys,0,3
2,1,Female,16.0,0,0,110152,28.8,southampton,1,Maioni,Miss,Roberta,0,3
3,1,Male,52.0,1,1,110413,26.5,southampton,0,Taussig,Mr,Emil,2,3
4,1,Female,39.0,1,1,110413,26.5,southampton,1,Taussig,Mrs,Emil (Tillie Mandelbaum),2,3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,1,Female,47.0,1,0,W.E.P. 5734,30.6,southampton,1,Chaffee,Mrs,Herbert Fuller (Carrie Constance Toogood),1,2
1305,1,Male,46.0,1,0,W.E.P. 5734,30.6,southampton,0,Chaffee,Mr,Herbert Fuller,1,2
1306,2,Male,30.0,0,0,W/C 14208,10.5,southampton,0,Harris,Mr,Walter,0,1
1307,1,Male,70.0,1,1,WE/P 5735,35.5,southampton,0,Crosby,Capt,Edward Gifford,2,2
1308,1,Female,36.0,0,2,WE/P 5735,35.5,southampton,1,Crosby,Miss,Harriet R,2,2

In [45]:
# df.loc[df['fare'].max(512.3)]

In [46]:
df.to_csv('titanic1.csv')

# Data Analyst

# conclusion